{
  "guidelines": "Please annotate if a social media post contains hate speech or not.\n\nA post contains hate speech if it contains any of the following aspects:\n- Assaults on Human Dignity: Does the post demean or degrade individuals or groups based on race, ethnicity, gender, religion, sexual orientation, or other protected characteristics?\n- Calls for Violence: Does the post incite or encourage physical harm or violence against individuals or groups?\n- Vulgarity and/or Offensive Language: Does the post contain profanity, slurs, or other offensive language that may or may not be directed at individuals or groups?\n\nLabels:\n- 0 (the post contains no hate speech)\n- 1 (the post contains hate speech)\n\nEdge Case Handling:\n1. when the post targets non-protected groups, individuals, or characteristics (e.g., political groups, institutions, public figures) without explicit calls for violence or slurs targeting protected groups -> classify as 0 (no hate speech)\n2. when the post references protected groups but lacks explicit assaults on dignity, calls for violence, or vulgarity/offensive language directed at them -> classify as 0 (no hate speech)\n3. when the post contains references to violence, threats, or aggressive language without inciting harm against protected groups or using explicit hate speech elements -> classify as 0 (no hate speech)\n4. when the post uses implicit antagonism, generalizations, or ambiguous framing without explicit demeaning language, calls for violence, or offensive targeting of protected groups -> classify as 0 (no hate speech)\n5. when content lacks sufficient information for evaluation (e.g., URLs, non-text media, ambiguous language, or insufficient context) -> refuse to classify (-1)\n6. when ambiguous/coded references to protected groups lack explicit demeaning language, calls for violence, or clarifying context -> classify as no hate speech (0) but flag for review\n7. when a post dehumanizes protected groups by invalidating identities or trivializing atrocities through symbolism/narratives -> classify as hate speech (1)\n8. when content reports offensive material or uses insensitive language without direct targeting of protected groups -> classify as no hate speech (0) but flag for review/insensitivity\n9. when content lacks explicit evidence of demeaning language, calls for violence, or offensive slurs targeting protected characteristics, despite potential ambiguity, sarcasm, indirect references, or coded language -> classify as 0 (no hate speech) with low confidence due to ambiguity\n"
}
